using static System.Runtime.InteropServices.JavaScript.JSType;

namespace eDiary
{
//    Створіть консольну програму-щоденник, що відповідає наступним вимогам: 
//1.При запуску консолі користувача просять вибрати – зареєстрований він уже чи хоче зареєструватися.
//2.Якщо користувач хоче зареєструватися, його просять ввести бажаний логін і пароль.
//Логін перевіряється на унікальність
//– наявність у системі такого ж.Після реєстрації користувача знову запитують, як у п.1. 
//3.Якщо користувач хоче авторизуватись і вже зареєстрований у системі – користувача просять ввести логін
//та пароль для входу. 
//4.Після авторизації користувачеві виводять поточну дату та просять ввести сьогоднішній запис особистого
//електронного щоденника рядково.Для виходу користувач вводить quit.
//5.Після введення тексту сьогоднішнього запису інформація по кожному користувачеві повинна зберігатися так,
//щоб при наступному запуску ви могли отримати доступ до всіх попередніх записів.
//6.Отримати доступ до всіх записів можна за допомогою п.4 замість “quit” слово “data”.
//7. Система повинна мати можливість підтримувати роботу з кількома користувачами (не одночасно),
//зберігаючи їх записи.

    internal class Program
    {
        static void Main(string[] args)
        {
            ConsoleApp app = ConsoleApp.GetConsoleApp();   
            app.RunApp();
        }
    }
}
